export/outline.tex
% Created 2024-07-06 Sat 15:05
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\author{Gleefre}
\date{\today}
\title{PLN CDR draft: outline}
\hypersetup{
 pdfauthor={Gleefre},
 pdftitle={PLN CDR draft: outline},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
[THIS IS A DRAFT]

\section{Specification}
\label{sec:orgad0148e}
\href{./spec.pdf}{Specification}
\section{ISSUES}
\label{sec:org8d1aa0d}
\begin{itemize}
\item \href{./issues/1.pdf}{Issue 1 (ADD-/REMOVE-PACKAGE-LOCAL-NICKNAME return values)}
\item \href{./issues/2.pdf}{Issue 2 (PRINT-READ consistency)}
\item \href{./issues/3.pdf}{Issue 3 (Local nicknames effect on DEFPACKAGE, MAKE-PACKAGE and others)}
\item \href{./issues/4.pdf}{Issue 4 (Local nicknames of the package being defined)}
\item \href{./issues/5.pdf}{Issue 5 (Local nickname shadowing package's own name)}
\item \href{./issues/6.pdf}{Issue 6 (Additional keyword argument to MAKE-PACKAGE)}
\item \href{./issues/7.pdf}{Issue 7 (Multiple local nicknames)}
\item \href{./issues/8.pdf}{Issue 8 (Interaction with FORMAT)}
\item \href{./issues/9.pdf}{Issue 9 (Empty package local name)}
\end{itemize}
\section{Links}
\label{sec:orgf749d11}
3b's \href{https://github.com/3b/package-local-nicknames/blob/master/docs.org}{notes} on package-local nicknames.

phoe's \href{https://github.com/phoe/trivial-package-local-nicknames}{tests}.

SBCL's \href{https://www.sbcl.org/manual/\#Package\_002dLocal-Nicknames}{manual entry}.

Section 4.3 of the ABCL's manual. (\href{https://github.com/armedbear/abcl/blob/master/doc/manual/abcl.tex\#L1249}{\TeX{} file on github})
\section{Copying and License}
\label{sec:orgd8b07d3}
[TODO]
\end{document}